lxf13927043839/Stm32_code/bluetooth/USER/main.c
// /*------------------------------------------------------------------- 
//	1、汉字大小：24*24共 72字节
//  2、显示汉字时调用对应序号：
//	温(0) 湿(1) 度(2) 光(3) 照(4) 强(5) 度(6) 窗(7) 帘(8) 状(9) 态(10) 智(11) 能(12) 手(13) 动(14) 模(15)
//       式(16) 阈（17） 值（18） 摄氏度（19） 百分号（20） 弱（21） 中（22） 强（23） 开（24） 关（25）
// */

extern u8 Zero_to_six_clock;
void LCD_showdate(void)
{
	int x=0,y=0;
	int level;
	u8 temp[2];
	RTC_DateTypeDef RTC_DateStruct;
	u8 temp_buff[40]; 
	
	BRUSH_COLOR=RED;      //设置画笔颜色为黑色
	//温度
	x=95,y=47;
	temp[0]=data_buff[1];
	temp[1]=data_buff[2];
	LCD_DisplayString(x,y,24,temp); //显示一个24字体字符串，宽只占了12,字符显示时候
	LCD_DisplayChinese_one(x+12*2,y,19,24);
	
	//湿度
	x=95;y=80;
	temp[0]=data_buff[4];
	temp[1]=data_buff[5];
	LCD_DisplayString(x,y,24,temp); //显示一个12/16/24字体字符串
	LCD_DisplayChinese_one(x+12*2,y,20,24);

	//光照强度----采用弱、中、强来表示，数字意义不大
	x=95;y=113;
	temp[0]=data_buff[7];
	temp[1]=data_buff[8];
	LCD_DisplayString(x,y,24,temp); //显示一个12/16/24字体字符串
	LCD_DisplayChinese_one(x+12*2,y,20,24);
	LCD_DisplayChar(x+12*2+24*1,y,'(',24);
	level=(temp[0]-48)*10+(temp[1]-48);
	if(level>=0&&level<=40)
	{
		LCD_DisplayChinese_one(x+12*2+24*2-12,y,21,24);
	}
	else if(level>40&&level<=70)
	{
		LCD_DisplayChinese_one(x+12*2+24*2-12,y,22,24);
	}
	else if(level>70&&level<=100)
	{
		LCD_DisplayChinese_one(x+12*2+24*2-12,y,23,24);
	}
	LCD_DisplayChar(x+12*2+24*3-12,y,')',24);
		
	//显示日期
	x=5;y=295;
	RTC_GetDate(RTC_Format_BIN, &RTC_DateStruct);
	sprintf((char*)temp_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
	//printf("%s\n",temp_buff);
	LCD_DisplayString(x,y,24,temp_buff); //显示一个12/16/24字体字符串
	
	//显示时间测试位置,显示ok---该函数放在秒的唤醒服务函数
	
}


////跳转到设置光照阈值的界面

extern const u8 gImage_set_light[];//设置光照阈值界面
extern const u8 gImage_set_time[]; //设置定时
extern const u8 gImage_smart_mode[];
extern const u8 gImage_hand_mode[];

/*
	功能：定时窗帘的开或者关---注意：把提示换成中文的

*/
/*

* 说    明：长按按KEY3进行时间调整，按KEY0进行数值的加1，按KEY1数值进行减1，  
            按KEY2右移选择要设置的选项，在调整完后短按KEY3，确认调整时间         
*********************************************************************************/

u8 const *set_option[7]={"Year","Month","Day","Hours","Minutes","Seconds"," "};

void Time_Display()//把变化的时间写入
{
 LCD_DisplayString(30,220,24,"Date:20  -  -  ");
 LCD_DisplayNum(114,220,RTC_DateStruct.RTC_Year,2,24,1);
 LCD_DisplayNum(150,220,RTC_DateStruct.RTC_Month,2,24,1);
 LCD_DisplayNum(186,220,RTC_DateStruct.RTC_Date,2,24,1);
 LCD_DisplayString(30,250,24,"Time:  :  :  ");
 LCD_DisplayNum(90,250,RTC_TimeStruct.RTC_Hours,2,24,1);	
 LCD_DisplayNum(126,250,RTC_TimeStruct.RTC_Minutes,2,24,1);
 LCD_DisplayNum(162,250,RTC_TimeStruct.RTC_Seconds,2,24,1);
 //LCD_DisplayString(30,260,16,"Week:        ");
 //LCD_DisplayString(70,260,16,(u8 *)weekdate[RTC_DateStruct.RTC_WeekDay-1]);
}
void Time_has_set()//显示定时的时间
{
 LCD_DisplayString(70,57,24,"20  -  -  ");
 LCD_DisplayNum(94,57,RTC_DateStruct.RTC_Year,2,24,1);
 LCD_DisplayNum(130,57,RTC_DateStruct.RTC_Month,2,24,1);
 LCD_DisplayNum(166,57,RTC_DateStruct.RTC_Date,2,24,1);
 LCD_DisplayString(70,81,24,"  :  :  ");
 LCD_DisplayNum(70,81,RTC_TimeStruct.RTC_Hours,2,24,1);	
 LCD_DisplayNum(106,81,RTC_TimeStruct.RTC_Minutes,2,24,1);
 LCD_DisplayNum(142,81,RTC_TimeStruct.RTC_Seconds,2,24,1);
}

void ADJUST_time(u8 option,u8 shanshuo)
{
		if(shanshuo%50==0)  //提示现在要设置的选项
		{
		  LCD_DisplayString_color(30,280,24,"Please Set          ",BLUE,WHITE);
		  LCD_DisplayString_color(162,280,24,(u8 *)set_option[option],BLUE,WHITE);
		}
		
		//设置时数值的加减1
		if( (keydown_data==KEY0_DATA)||(keydown_data==KEY1_DATA))
		{
		  if(keydown_data==KEY0_DATA)
			{
			  switch(option)
				{
				  case 0: RTC_DateStruct.RTC_Year+=1;   break;
					case 1:
								if(RTC_DateStruct.RTC_Month==12)
								{
									RTC_DateStruct.RTC_Month=1;
								}
								else
								RTC_DateStruct.RTC_Month+=1;  
								break;
					case 2: 
								if(RTC_DateStruct.RTC_Date==28&&RTC_DateStruct.RTC_Month==2&&RTC_DateStruct.RTC_Year%4!=0)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else if(RTC_DateStruct.RTC_Date==29&&RTC_DateStruct.RTC_Month==2&&RTC_DateStruct.RTC_Year%4==0)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else if(RTC_DateStruct.RTC_Date==30)
								{
									switch(RTC_DateStruct.RTC_Month)
									{
										case 4:
										case 6:
										case 9:
										case 11:
														RTC_DateStruct.RTC_Date=1;
														break;
										case 1:
										case 3:
										case 5:
										case 7:
										case 8:
										case 10:
										case 12:
														RTC_DateStruct.RTC_Date+=1;
														break;
									}
								}
								else if(RTC_DateStruct.RTC_Date==31)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else
								RTC_DateStruct.RTC_Date+=1;   
								break;
					case 3: 
								if(RTC_TimeStruct.RTC_Hours==23)
								{
									RTC_TimeStruct.RTC_Hours=0;
								}
								else
								RTC_TimeStruct.RTC_Hours+=1;  
								break;
					case 4: 
								if(RTC_TimeStruct.RTC_Minutes==59)
								{
									RTC_TimeStruct.RTC_Minutes=0;
								}
								else
								RTC_TimeStruct.RTC_Minutes+=1;
								break;
					case 5: 
								if(RTC_TimeStruct.RTC_Seconds==59)
								{
									RTC_TimeStruct.RTC_Seconds=0;
								}
								else
								RTC_TimeStruct.RTC_Seconds+=1;
								break;
				}	
			}
			if(keydown_data==KEY1_DATA)
			{
			  switch(option)
				{
				  case 0: RTC_DateStruct.RTC_Year-=1; break;
					case 1: 
								if(RTC_DateStruct.RTC_Month==1)
								{
									RTC_DateStruct.RTC_Month=12;
								}
								else
								RTC_DateStruct.RTC_Month-=1;
								break;
					case 2: 
								if(RTC_DateStruct.RTC_Date==1)
								{
									if((RTC_DateStruct.RTC_Year)%4==0&&(RTC_DateStruct.RTC_Month)==2)
									{
										RTC_DateStruct.RTC_Date=29;
									}
									else
									{
										if((RTC_DateStruct.RTC_Month)==2)
										{
											RTC_DateStruct.RTC_Date=28;
										}
										else
										{
											switch((RTC_DateStruct.RTC_Month))
											{
												case 1:
												case 3:
												case 5:
												case 7:
												case 8:
												case 10:
												case 12:
																RTC_DateStruct.RTC_Date=31;
												break;
												
												case 4:
												case 6:
												case 9:
												case 11:
																RTC_DateStruct.RTC_Date=30;
												break;
											}
										}
									}
								}
								else								
								RTC_DateStruct.RTC_Date-=1;//考虑到
							
								break;
					case 3: 
								if(RTC_TimeStruct.RTC_Hours==0)
								{
									RTC_TimeStruct.RTC_Hours=23;
								}
								else
								RTC_TimeStruct.RTC_Hours-=1;
							
								break;
					case 4: 
								if(RTC_TimeStruct.RTC_Hours==0)
								{
									RTC_TimeStruct.RTC_Minutes=59;
								}
								else
								RTC_TimeStruct.RTC_Minutes-=1;
								break;
					case 5: 
								if(RTC_TimeStruct.RTC_Seconds==0)
								{
									RTC_TimeStruct.RTC_Seconds=59;
								}
								else
								RTC_TimeStruct.RTC_Seconds-=1;
								break;
				}	
			}
		}
		//闪烁显示：显示
	if(shanshuo==150)
	{
			Time_Display();
//			LCD_DisplayNum(86,220,RTC_DateStruct.RTC_Year,2,16,1);
//			LCD_DisplayNum(110,220,RTC_DateStruct.RTC_Month,2,16,1);
//			LCD_DisplayNum(134,220,RTC_DateStruct.RTC_Date,2,16,1);
//			LCD_DisplayNum(70,240,RTC_TimeStruct.RTC_Hours,2,16,1);
//			LCD_DisplayNum(94,240,RTC_TimeStruct.RTC_Minutes,2,16,1);
//			LCD_DisplayNum(118,240,RTC_TimeStruct.RTC_Seconds,2,16,1);
	}	
		//闪烁显示：不显示
	switch(option)
	{  
		case 0: {  if(shanshuo==49)  LCD_DisplayString(114,220,24,"  ");	 break;  }
		case 1: {  if(shanshuo==49)  LCD_DisplayString(150,220,24,"  "); break;  }
		case 2: {  if(shanshuo==49)  LCD_DisplayString(186,220,24,"  "); break;  }
		case 3: {  if(shanshuo==49)  LCD_DisplayString(90,250,24,"  ");  break;  }
		case 4: {  if(shanshuo==49)	 LCD_DisplayString(126,250,24,"  ");	 break;	 }
		case 5: {  if(shanshuo==49)	 LCD_DisplayString(162,250,24,"  "); break;  }		
	}
}	


